from site_objects import SiteObjects


"""Элементы страницы \"Документы\" """

elem_on_documents_page = SiteObjects(
    "Заголовок 'ДОКУМЕНТЫ ООО «ВОЗОВОЗ»'",
    "//h2[text()='ДОКУМЕНТЫ ООО «ВОЗОВОЗ»']")

file_1_on_documents_page = SiteObjects(
    "Файл 'Договор на оказание транспортно-экспедиционных услуг' на странице документы",
    "//a[contains(text(), 'Договор на оказание транспортно-экспедиционных услуг')]")

file_2_on_documents_page = SiteObjects(
    "Файл 'Перечень грузов, подлежащих обязательной защитной жесткой упаковке' на странице документы",
    "//a[contains(text(), 'Перечень грузов, подлежащих обязательной защитной жесткой упаковке')]")

file_3_on_documents_page = SiteObjects(
    "Файл 'Перечень грузов, подлежащих обязательной защитной жесткой упаковке' на странице документы",
    "//a[contains(text(), 'Перечень не принимаемых к транспортировке грузов')]")

file_4_on_documents_page = SiteObjects(
    "Файл 'Перечень опасных грузов' на странице документы",
    "//a[contains(text(), 'Перечень опасных грузов')]")

file_5_on_documents_page = SiteObjects(
    "Файл 'Правила САО \"ВСК\" транспортного страхования грузов' на странице документы",
    "//a[contains(text(), 'Правила САО \"ВСК\" транспортного страхования грузов')]")

file_6_on_documents_page = SiteObjects(
    "Файл 'Информационное письмо о заключении с САО \"ВСК\" договора страхования грузов' на странице документы",
    "//a[contains(text(), 'Информационное письмо о заключении с САО \"ВСК\" договора страхования грузов')]")

file_7_on_documents_page = SiteObjects(
    "Файл 'Правила АО \"СК ПАРИ\" транспортного страхования грузов' на странице документы",
    "//a[contains(text(), 'Правила АО \"СК ПАРИ\" транспортного страхования грузов')]")

file_8_on_documents_page = SiteObjects(
    "Файл 'Информационные письма о заключении с АО \"СК ПАРИ\" договоров страхования грузов' на странице документы",
    "//a[contains(text(), 'Правила АО \"СК ПАРИ\" транспортного страхования грузов')]")

file_9_on_documents_page = SiteObjects(
    "Файл 'Информационное письмо к правилам САО \"ВСК\" и АО \"СК ПАРИ\" страхования грузов' на странице документы",
    "//a[contains(text(), 'Информационное письмо к правилам САО \"ВСК\" и АО \"СК ПАРИ\" страхования грузов')]")

file_10_on_documents_page = SiteObjects(
    "Файл 'Грузы, не подлежащие страхованию' на странице документы",
    "//a[contains(text(), 'Грузы, не подлежащие страхованию')]")

file_11_on_documents_page = SiteObjects(
    "Файл 'Уведомление об изменении правил оказания услуг (20.07.2016)' на странице документы",
    "//a[contains(text(), 'Уведомление об изменении правил оказания услуг (20.07.2016)')]")

file_12_on_documents_page = SiteObjects(
    "Файл 'Уведомление об изменении правил оказания услуг (14.11.2016)' на странице документы",
    "//a[contains(text(), 'Уведомление об изменении правил оказания услуг (14.11.2016)')]")

file_13_on_documents_page = SiteObjects(
    "Файл 'Уведомление об изменении правил оказания услуг (15.08.2019)' на странице документы",
    "//a[contains(text(), 'Уведомление об изменении правил оказания услуг (15.08.2019)')]")

file_14_on_documents_page = SiteObjects(
    "Файл 'Уведомление об изменении правил оказания услуг (30.03.2020)' на странице документы",
    "//a[contains(text(), 'Уведомление об изменении правил оказания услуг (30.03.2020)')]")

file_15_on_documents_page = SiteObjects(
    "Файл 'Уведомление об изменении правил оказания услуг (01.04.2020)' на странице документы",
    "//a[contains(text(), 'Уведомление об изменении правил оказания услуг (01.04.2020)')]")

file_16_on_documents_page = SiteObjects(
    "Файл 'Уведомление об изменении правил оказания услуг (01.07.2020)' на странице документы",
    "//a[contains(text(), 'Уведомление об изменении правил оказания услуг (01.07.2020)')]")

file_17_on_documents_page = SiteObjects(
    "Файл 'Уведомление об изменении правил оказания услуг (28.12.2023)' на странице документы",
    "//a[contains(text(), 'Уведомление об изменении правил оказания услуг (28.12.2023)')]")

file_18_on_documents_page = SiteObjects(
    "Файл 'Перечень экспедиторских документов' на странице документы",
    "//a[contains(text(), 'Перечень экспедиторских документов')]")

file_19_on_documents_page = SiteObjects(
    "Файл 'Универсальный передаточный документ (УПД)' на странице документы",
    "//a[contains(text(), 'Универсальный передаточный документ (УПД)')]")

file_20_on_documents_page = SiteObjects(
    "Файл 'Опись передаваемого экспедитору имущества (для физических лиц)' на странице документы",
    "//a[contains(text(), 'Опись передаваемого экспедитору имущества (для физических лиц)')]")

file_21_on_documents_page = SiteObjects(
    "Файл 'Образец претензии экспедитору' на странице документы",
    "//a[contains(text(), 'Образец претензии экспедитору')]")

file_22_on_documents_page = SiteObjects(
    "Файл 'Письмо о возврате излишне уплаченных платежей' на странице документы",
    "//a[contains(text(), 'Письмо о возврате излишне уплаченных платежей')]")

file_23_on_documents_page = SiteObjects(
    "Файл 'Распоряжение о смене получателя груза' на странице документы",
    "//a[contains(text(), 'Распоряжение о смене получателя груза')]")

file_24_on_documents_page = SiteObjects(
    "Файл 'Уведомление об оплате за третье лицо' на странице документы",
    "//a[contains(text(), 'Уведомление об оплате за третье лицо')]")

file_25_on_documents_page = SiteObjects(
    "Файл 'Распоряжение о перенаправлении груза' на странице документы",
    "//a[contains(text(), 'Распоряжение о перенаправлении груза')]")

file_26_on_documents_page = SiteObjects(
    "Файл 'Уведомление о намерении оплатить услуги' на странице документы",
    "//a[contains(text(), 'Уведомление о намерении оплатить услуги')]")

file_27_on_documents_page = SiteObjects(
    "Файл 'Реквизиты ООО \"Возовоз\"' на странице документы",
    "//a[contains(text(), 'Реквизиты ООО \"Возовоз\"')]")

file_28_on_documents_page = SiteObjects(
    "Файл 'Уведомление об отказе от использования печати' на странице документы",
    "//a[contains(text(), 'Уведомление об отказе от использования печати')]")

file_29_on_documents_page = SiteObjects(
    "Файл 'Договор хранения' на странице документы",
    "//a[contains(text(), 'Договор хранения')]")

file_30_on_documents_page = SiteObjects(
    "Файл 'Грузы, подлежащие обязательной жесткой упаковке' на странице документы",
    "//a[contains(text(), 'Грузы, подлежащие обязательной жесткой упаковке')]")

file_31_on_documents_page = SiteObjects(
    "Файл 'Перечень грузов, не принимаемых на хранение' на странице документы",
    "//a[contains(text(), 'Перечень грузов, не принимаемых на хранение')]")

file_32_on_documents_page = SiteObjects(
    "Файл 'Грузы, не подлежащие страхованию.pdf' на странице документы",
    "//a[contains(text(), 'Грузы, не подлежащие страхованию.pdf')]")

file_33_on_documents_page = SiteObjects(
    "Файл 'Бланк генеральной доверенности на сдачу и получение грузов' на странице документы",
    "//a[contains(text(), 'Бланк генеральной доверенности на сдачу и получение грузов')]")

file_34_on_documents_page = SiteObjects(
    "Файл 'Бланк разовой доверенности на получение груза' на странице документы",
    "//a[contains(text(), 'Бланк разовой доверенности на получение груза')]")

file_35_on_documents_page = SiteObjects(
    "Файл 'Бланк разовой доверенности на сдачу экспедитору груза' на странице документы",
    "//a[contains(text(), 'Бланк разовой доверенности на сдачу экспедитору груза')]")

file_36_on_documents_page = SiteObjects(
    "Файл 'Договор транспортной экспедиции' на странице документы",
    "//a[contains(text(), 'Договор транспортной экспедиции')]")

file_37_on_documents_page = SiteObjects(
    "Файл 'Заявка экспедитору' на странице документы",
    "//a[contains(text(), 'Заявка экспедитору')]")

file_38_on_documents_page = SiteObjects(
    "Файл 'Перечень ограничений и грузов, не принимаемых к перевозке' на странице документы",
    "//a[contains(text(), 'Перечень ограничений и грузов, не принимаемых к перевозке')]")

file_39_on_documents_page = SiteObjects(
    "Файл 'Перечень опасных грузов, не принимаемых к перевозке' на странице документы",
    "//a[contains(text(), 'Перечень опасных грузов, не принимаемых к перевозке')]")

file_40_on_documents_page = SiteObjects(
    "Файл 'Сводная ведомость результатов СОУТ в 2019г' на странице документы",
    "//a[contains(text(), 'Сводная ведомость результатов СОУТ в 2019г')]")

file_41_on_documents_page = SiteObjects(
    "Файл 'Сводная ведомость результатов СОУТ в 2021г' на странице документы",
    "//a[contains(text(), 'Сводная ведомость результатов СОУТ в 2021г')]")

file_42_on_documents_page = SiteObjects(
    "Файл 'Перечень рекомендуемых мероприятий по результатам СОУТ в 2021г' на странице документы",
    "//a[contains(text(), 'Перечень рекомендуемых мероприятий по результатам СОУТ в 2021г')]")

file_43_on_documents_page = SiteObjects(
    "Файл 'Сводная ведомость результатов СОУТ в 2022' на странице документы",
    "//a[contains(text(), 'Сводная ведомость результатов СОУТ в 2022')]")

file_44_on_documents_page = SiteObjects(
    "Файл 'Перечень мероприятий СОУТ Возовоз 2024.pdf' на странице документы",
    "//a[contains(text(), 'Перечень мероприятий СОУТ Возовоз 2024.pdf')]")

file_45_on_documents_page = SiteObjects(
    "Файл 'Сводная ведомость результатов СОУТ Возовоз 2024.pdf' на странице документы",
    "//a[contains(text(), 'Сводная ведомость результатов СОУТ Возовоз 2024.pdf')]")

file_46_on_documents_page = SiteObjects(
    "Файл 'Перечень опасных грузов' на странице документы",
    "//a[contains(text(), 'Перечень опасных грузов')]")

file_47_on_documents_page = SiteObjects(
    "Файл 'Договор транспортной экспедиции на международную перевозку' на странице документы",
    "//a[contains(text(), 'Договор транспортной экспедиции на международную перевозку')]")

file_48_on_documents_page = SiteObjects(
    "Файл 'Грузы, подлежащие обязательной жесткой упаковке' на странице документы",
    "//a[contains(text(), 'Грузы, подлежащие обязательной жесткой упаковке')]")

file_49_on_documents_page = SiteObjects(
    "Файл 'Грузы, не подлежащие страхованию.pdf' на странице документы",
    "//a[contains(text(), 'Грузы, не подлежащие страхованию.pdf')]")

file_50_on_documents_page = SiteObjects(
    "Файл 'Грузы не принимаемые к перевозке' на странице документы",
    "//a[contains(text(), 'Грузы не принимаемые к перевозке')]")







